*** crates/agent-app/src/runtime.rs:42:25: replace match guard !id.trim().is_empty() with true in AgentRuntime::handle_message

*** mutation diff:
--- crates/agent-app/src/runtime.rs
+++ replace match guard !id.trim().is_empty() with true in AgentRuntime::handle_message
@@ -34,17 +34,17 @@
     ) -> Result<HandleMessageResult, AgentError> {
         if user_message.trim().is_empty() {
             return Err(AgentError::InvalidInput(
                 "message content cannot be empty".into(),
             ));
         }
 
         let session_id = match session_id {
-            Some(id) if !id.trim().is_empty() => id.to_string(),
+            Some(id) if true /* ~ changed by cargo-mutants ~ */ => id.to_string(),
             _ => {
                 self.message_store
                     .get_or_create_default_session(user_id)
                     .await?
             }
         };
 
         self.message_store

---- runtime::tests::handle_message_with_empty_session_id_creates_new_session stdout ----

thread 'runtime::tests::handle_message_with_empty_session_id_creates_new_session' (60644) panicked at crates/agent-app/src/runtime_tests.rs:174:5:
assertion failed: !result.session_id.is_empty()

---- runtime::tests::handle_message_with_whitespace_session_id_creates_new_session stdout ----

thread 'runtime::tests::handle_message_with_whitespace_session_id_creates_new_session' (60646) panicked at crates/agent-app/src/runtime_tests.rs:202:5:
assertion failed: !result.session_id.trim().is_empty()

failures:
    runtime::tests::handle_message_with_empty_session_id_creates_new_session
    runtime::tests::handle_message_with_whitespace_session_id_creates_new_session

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
