*** crates/agent-app/src/runtime.rs:42:25: replace match guard !id.trim().is_empty() with false in AgentRuntime::handle_message

*** mutation diff:
--- crates/agent-app/src/runtime.rs
+++ replace match guard !id.trim().is_empty() with false in AgentRuntime::handle_message
@@ -34,17 +34,17 @@
     ) -> Result<HandleMessageResult, AgentError> {
         if user_message.trim().is_empty() {
             return Err(AgentError::InvalidInput(
                 "message content cannot be empty".into(),
             ));
         }
 
         let session_id = match session_id {
-            Some(id) if !id.trim().is_empty() => id.to_string(),
+            Some(id) if false /* ~ changed by cargo-mutants ~ */ => id.to_string(),
             _ => {
                 self.message_store
                     .get_or_create_default_session(user_id)
                     .await?
             }
         };
 
         self.message_store

---- runtime::tests::handle_message_with_store_persists_and_uses_history stdout ----

thread 'runtime::tests::handle_message_with_store_persists_and_uses_history' (60863) panicked at crates/agent-app/src/runtime_tests.rs:110:5:
assertion `left == right` failed
  left: "default-session"
 right: "s1"

failures:
    runtime::tests::handle_message_with_store_persists_and_uses_history

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
