*** crates/agent-app/src/runtime.rs:42:25: delete ! in AgentRuntime::handle_message

*** mutation diff:
--- crates/agent-app/src/runtime.rs
+++ delete ! in AgentRuntime::handle_message
@@ -34,17 +34,17 @@
     ) -> Result<HandleMessageResult, AgentError> {
         if user_message.trim().is_empty() {
             return Err(AgentError::InvalidInput(
                 "message content cannot be empty".into(),
             ));
         }
 
         let session_id = match session_id {
-            Some(id) if !id.trim().is_empty() => id.to_string(),
+            Some(id) if  /* ~ changed by cargo-mutants ~ */id.trim().is_empty() => id.to_string(),
             _ => {
                 self.message_store
                     .get_or_create_default_session(user_id)
                     .await?
             }
         };
 
         self.message_store

---- runtime::tests::handle_message_with_store_persists_and_uses_history stdout ----

thread 'runtime::tests::handle_message_with_store_persists_and_uses_history' (61081) panicked at crates/agent-app/src/runtime_tests.rs:110:5:
assertion `left == right` failed
  left: "default-session"
 right: "s1"

---- runtime::tests::handle_message_with_whitespace_session_id_creates_new_session stdout ----

thread 'runtime::tests::handle_message_with_whitespace_session_id_creates_new_session' (61082) panicked at crates/agent-app/src/runtime_tests.rs:202:5:
assertion failed: !result.session_id.trim().is_empty()

---- runtime::tests::handle_message_with_empty_session_id_creates_new_session stdout ----

thread 'runtime::tests::handle_message_with_empty_session_id_creates_new_session' (61080) panicked at crates/agent-app/src/runtime_tests.rs:174:5:
assertion failed: !result.session_id.is_empty()

failures:
    runtime::tests::handle_message_with_empty_session_id_creates_new_session
    runtime::tests::handle_message_with_store_persists_and_uses_history
    runtime::tests::handle_message_with_whitespace_session_id_creates_new_session

test result: FAILED. 20 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
