*** crates/agent-app/src/service.rs:10:47: replace * with /

*** mutation diff:
--- crates/agent-app/src/service.rs
+++ replace * with /
@@ -2,17 +2,17 @@
 use std::time::{SystemTime, UNIX_EPOCH};
 
 use agent_domain::{AuthError, AuthPort};
 use agent_types::types::TokenPair;
 use jsonwebtoken::{Algorithm, DecodingKey, EncodingKey, Header, Validation, decode, encode};
 use serde::{Deserialize, Serialize};
 
 const ACCESS_TOKEN_TTL_SECONDS: i64 = 60 * 60;
-const REFRESH_TOKEN_TTL_SECONDS: i64 = 7 * 24 * 60 * 60;
+const REFRESH_TOKEN_TTL_SECONDS: i64 = 7 * 24 / /* ~ changed by cargo-mutants ~ */ 60 * 60;
 
 #[derive(Debug, Clone, Serialize, Deserialize)]
 pub struct Claims {
     pub sub: String,
     pub exp: usize,
     pub iat: usize,
     pub token_type: String,
 }

---- service::tests::login_refresh_token_expires_in_seven_days stdout ----

thread 'service::tests::login_refresh_token_expires_in_seven_days' (62395) panicked at crates/agent-app/src/service_tests.rs:91:5:
refresh token should expire in ~7 days, got 120

failures:
    service::tests::login_refresh_token_expires_in_seven_days

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
