*** crates/agent-app/src/service.rs:115:30: replace + with * in AuthService::create_token_pair

*** mutation diff:
--- crates/agent-app/src/service.rs
+++ replace + with * in AuthService::create_token_pair
@@ -107,17 +107,17 @@
         )
         .map_err(|_| AuthServiceError::TokenValidation)?;
 
         Ok(token_data.claims)
     }
 
     fn create_token_pair(&self, user_id: &str) -> Result<TokenPair, AuthServiceError> {
         let now = current_unix_seconds();
-        let access_exp = now + ACCESS_TOKEN_TTL_SECONDS;
+        let access_exp = now * /* ~ changed by cargo-mutants ~ */ ACCESS_TOKEN_TTL_SECONDS;
         let refresh_exp = now + REFRESH_TOKEN_TTL_SECONDS;
 
         let access_token = self
             .sign_token(user_id, now, access_exp, "access")
             .map_err(|_| AuthServiceError::TokenCreation)?;
 
         let refresh_token = self
             .sign_token(user_id, now, refresh_exp, "refresh")

---- service::tests::login_access_token_expires_in_one_hour stdout ----

thread 'service::tests::login_access_token_expires_in_one_hour' (63312) panicked at crates/agent-app/src/service_tests.rs:72:5:
access token should expire in ~1 hour, got 6376671954471

failures:
    service::tests::login_access_token_expires_in_one_hour

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
