*** crates/agent-app/src/service.rs:116:31: replace + with * in AuthService::create_token_pair

*** mutation diff:
--- crates/agent-app/src/service.rs
+++ replace + with * in AuthService::create_token_pair
@@ -108,17 +108,17 @@
         .map_err(|_| AuthServiceError::TokenValidation)?;
 
         Ok(token_data.claims)
     }
 
     fn create_token_pair(&self, user_id: &str) -> Result<TokenPair, AuthServiceError> {
         let now = current_unix_seconds();
         let access_exp = now + ACCESS_TOKEN_TTL_SECONDS;
-        let refresh_exp = now + REFRESH_TOKEN_TTL_SECONDS;
+        let refresh_exp = now * /* ~ changed by cargo-mutants ~ */ REFRESH_TOKEN_TTL_SECONDS;
 
         let access_token = self
             .sign_token(user_id, now, access_exp, "access")
             .map_err(|_| AuthServiceError::TokenCreation)?;
 
         let refresh_token = self
             .sign_token(user_id, now, refresh_exp, "refresh")
             .map_err(|_| AuthServiceError::TokenCreation)?;

---- service::tests::login_refresh_token_expires_in_seven_days stdout ----

thread 'service::tests::login_refresh_token_expires_in_seven_days' (63751) panicked at crates/agent-app/src/service_tests.rs:96:5:
refresh token should expire in ~7 days, got 1071576777874070

failures:
    service::tests::login_refresh_token_expires_in_seven_days

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
