*** crates/agent-app/src/service.rs:165:5: replace current_unix_seconds -> i64 with 1

*** mutation diff:
--- crates/agent-app/src/service.rs
+++ replace current_unix_seconds -> i64 with 1
@@ -157,17 +157,14 @@
     match err {
         AuthError::InvalidCredentials => AuthServiceError::InvalidCredentials,
         AuthError::AlreadyExists(msg) => AuthServiceError::AlreadyExists(msg),
         AuthError::Internal(msg) => AuthServiceError::Internal(msg),
     }
 }
 
 fn current_unix_seconds() -> i64 {
-    SystemTime::now()
-        .duration_since(UNIX_EPOCH)
-        .expect("system clock should be after UNIX_EPOCH")
-        .as_secs() as i64
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[path = "service_tests.rs"]
 mod tests;

---- service::tests::login_tokens_are_valid_jwt stdout ----

thread 'service::tests::login_tokens_are_valid_jwt' (64595) panicked at crates/agent-app/src/service_tests.rs:113:10:
access token is valid jwt: TokenValidation

---- service::tests::validate_token_with_valid_access_token stdout ----

thread 'service::tests::validate_token_with_valid_access_token' (64602) panicked at crates/agent-app/src/service_tests.rs:223:49:
valid token: TokenValidation

failures:
    service::tests::login_tokens_are_valid_jwt
    service::tests::validate_token_with_valid_access_token

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
