*** crates/agent-app/src/service.rs:165:5: replace current_unix_seconds -> i64 with -1

*** mutation diff:
--- crates/agent-app/src/service.rs
+++ replace current_unix_seconds -> i64 with -1
@@ -157,17 +157,14 @@
     match err {
         AuthError::InvalidCredentials => AuthServiceError::InvalidCredentials,
         AuthError::AlreadyExists(msg) => AuthServiceError::AlreadyExists(msg),
         AuthError::Internal(msg) => AuthServiceError::Internal(msg),
     }
 }
 
 fn current_unix_seconds() -> i64 {
-    SystemTime::now()
-        .duration_since(UNIX_EPOCH)
-        .expect("system clock should be after UNIX_EPOCH")
-        .as_secs() as i64
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[path = "service_tests.rs"]
 mod tests;

---- service::tests::validate_token_with_valid_access_token stdout ----

thread 'service::tests::validate_token_with_valid_access_token' (64818) panicked at crates/agent-app/src/service_tests.rs:217:18:
attempt to add with overflow

---- service::tests::validate_token_expired_returns_error stdout ----

thread 'service::tests::validate_token_expired_returns_error' (64816) panicked at crates/agent-app/src/service_tests.rs:279:46:
called `Result::unwrap_err()` on an `Ok` value: Claims { sub: "user-001", exp: 18446744073709551495, iat: 18446744073709544415, token_type: "access" }

---- service::tests::validate_token_wrong_secret_returns_error stdout ----

thread 'service::tests::validate_token_wrong_secret_returns_error' (64819) panicked at crates/agent-app/src/service_tests.rs:299:18:
attempt to add with overflow

failures:
    service::tests::login_tokens_are_valid_jwt
    service::tests::validate_token_expired_returns_error
    service::tests::validate_token_with_valid_access_token
    service::tests::validate_token_wrong_secret_returns_error

test result: FAILED. 19 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
