*** crates/agent-app/src/service.rs:9:42: replace * with +

*** mutation diff:
--- crates/agent-app/src/service.rs
+++ replace * with +
@@ -1,17 +1,17 @@
 use std::sync::Arc;
 use std::time::{SystemTime, UNIX_EPOCH};
 
 use agent_domain::{AuthError, AuthPort};
 use agent_types::types::TokenPair;
 use jsonwebtoken::{Algorithm, DecodingKey, EncodingKey, Header, Validation, decode, encode};
 use serde::{Deserialize, Serialize};
 
-const ACCESS_TOKEN_TTL_SECONDS: i64 = 60 * 60;
+const ACCESS_TOKEN_TTL_SECONDS: i64 = 60 + /* ~ changed by cargo-mutants ~ */ 60;
 const REFRESH_TOKEN_TTL_SECONDS: i64 = 7 * 24 * 60 * 60;
 
 #[derive(Debug, Clone, Serialize, Deserialize)]
 pub struct Claims {
     pub sub: String,
     pub exp: usize,
     pub iat: usize,
     pub token_type: String,

---- service::tests::login_access_token_expires_in_one_hour stdout ----

thread 'service::tests::login_access_token_expires_in_one_hour' (61301) panicked at crates/agent-app/src/service_tests.rs:67:5:
access token should expire in ~1 hour, got 120

failures:
    service::tests::login_access_token_expires_in_one_hour

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
